Revit 2024 API
PanelScheduleView.GetLoadClassificationDemandLoad Method
 Gets the Demand Load for given Load Classification
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string GetLoadClassificationDemandLoad(
	int nRow,
	int nCol
)
Visual Basic
Public Function GetLoadClassificationDemandLoad ( _
	nRow As Integer, _
	nCol As Integer _
) As String
Visual C++
public:
String^ GetLoadClassificationDemandLoad(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 Row number of Load Summary Section
nCol
Type: System.Int32
 Column number of Load Summary Section
Return Value
 The Demand Load for the Load Classification
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace